ko/find.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<title>find</title>
<!-- 2018-02-25 Sun 05:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="find - 리눅스 명령어">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="find - 리눅스 명령어">
<meta property="og:description" content="">
<meta name="twitter:title" content="find - 리눅스 명령어">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">find</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#configuration">설정</a></li>
<li><a href="#options">옵션</a></li>
<li><a href="#examples">사용 예</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-usage" class="outline-2">
<h2 id="usage"><a id="sec-1" name="sec-1"></a>사용법</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-syntax" class="outline-3">
<h3 id="syntax"><a id="sec-1-1" name="sec-1-1"></a>구조</h3>
<div class="outline-text-3" id="text-syntax">
</div>
</div>

<div id="outline-container-configuration" class="outline-3">
<h3 id="configuration"><a id="sec-1-2" name="sec-1-2"></a>설정</h3>
<div class="outline-text-3" id="text-configuration">
</div>
</div>

<div id="outline-container-options" class="outline-3">
<h3 id="options"><a id="sec-1-3" name="sec-1-3"></a>옵션</h3>
<div class="outline-text-3" id="text-options">
</div>
</div>

<div id="outline-container-examples" class="outline-3">
<h3 id="examples"><a id="sec-1-4" name="sec-1-4"></a>사용 예</h3>
<div class="outline-text-3" id="text-examples">

<ul class="org-ul">
<li>find . -type f -name *jpg -exec cp {} . \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 *.jpg 를 찾아 현재 디렉토리에 복사하기
</li>
</ul>
</li>
<li>find . -type f -size +10000 -exec ls -alh {} \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 10M 이상의 파일을 찾아서 출력하기
</li>
</ul>
</li>
<li>find . -atime +1 -type f -exec mv {} imsi\;
<ul class="org-ul">
<li>현재 디렉토리로 부터 하루 이상 경과한 파일을 imsi 디렉토리로 이동 시키기
</li>
</ul>
</li>
<li>find . -name "-F" -exec rm {} \;
<ul class="org-ul">
<li>"-F" 라는 파일을 찾아 삭제하기
</li>
</ul>
</li>
<li>find . -exec grep -i "찾는 문자열" {} \;
<ul class="org-ul">
<li>현재 디렉토리에서 대소문자에 상관없이 "찾는 문자열" 을 포함한 라인을 출력하기.
</li>
</ul>
</li>
<li>find . \! -name "*.Z" -exec compress -f {} \;
<ul class="org-ul">
<li>현재 디렉토리로 부터 *.Z 파일을 제외한 나머지 파일들을 *.Z으로 압축하기
</li>
</ul>
</li>
<li>find . -type f \! -name "*.Z" \! -name "제외할파일명" -print | tee -a /tmp/list
<ul class="org-ul">
<li>현재 디렉토리로부터 *.Z 파일을 제외하고 또한 "제외할 파일명" 외의 파일들을 터미널로 출력과 동시에 /tmp/list 에 추가하기
</li>
</ul>
</li>
<li>find . -name "*.ini"
<ul class="org-ul">
<li>현재 디렉토리로부터 이름이 *.ini인 파일을 출력하기
</li>
</ul>
</li>
<li>find . -exec chmod 755 {} \; or chmod -R 755 ./;
<ul class="org-ul">
<li>현재 디렉토리 이하 서브 디렉토리를 포함한 모든 파일들에 대해 퍼미션 755로 변경하기
</li>
</ul>
</li>
<li>find . -user xuser1 -exec chown -R user2 {} \; or chown -R user2 ./
<ul class="org-ul">
<li>현재 디렉토리로 부터 user1 소유자로 표시된 파일들을 모두 user2의 사용자 권한으로 변경하기
</li>
</ul>
</li>
<li>find . -atime +6
<ul class="org-ul">
<li>6일 이전의 파일들을 찾아 출력하기
</li>
</ul>
</li>
<li>find . -atime +30 -exec ls \; | wc -l
<ul class="org-ul">
<li>30일 이전 업데이트된 파일들의 라인수를 알아보기
</li>
</ul>
</li>
<li>find /raid -type d -name "디렉토리명" -ok cp /복사할경로 {} \;
<ul class="org-ul">
<li>/raid 디렉토리로 부터 "디렉토리명"을 가진 파일이 존재하면 / 복사할 경로로 복사하기
</li>
</ul>
</li>
<li>find . -name "찾을 파일" -print 2 &gt; /dev/null
<ul class="org-ul">
<li>찾을 파일 검색 도중 에러 및 경고 메시지는 표시하지 않게 하기
</li>
</ul>
</li>
<li>find . -perm 700 -print
<ul class="org-ul">
<li>파일 권한이 700인 파일을 찾기
</li>
</ul>
</li>
<li>find . \ ( -perm 400 -o -perm 200 \) -print
<ul class="org-ul">
<li>파일 권한이 400인 파일과 200인 파일을 찾아준다.
</li>
</ul>
</li>
<li>find . -size +1024 -print
<ul class="org-ul">
<li>파일의 블럭 크기가 1024 이상인 파일을 찾아준다.
</li>
</ul>
</li>
<li>find . -name core -size +2048 -print
<ul class="org-ul">
<li>파일 이름이 core이고 크기가 2048블럭 이상인 파일을 찾아준다.
</li>
</ul>
</li>
<li>find . -mtime -7 -print
<ul class="org-ul">
<li>7일 이내에 수정된 적이 있는 파일을 찾는다.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
